zlgopen/ametal/soc/hdsc/drivers/source/spi/am_hc32f460_spi_int.c
                event     = new_event;
                new_event = __SPI_EVT_NONE;
            }
        }
        /* no break */

        case __SPI_ST_TRANS_START:  /* 传输开始 */
        {
            am_spi_message_t  *p_cur_msg   = p_dev->p_cur_msg;

            if (event != __SPI_EVT_TRANS_LAUNCH) {
                return -AM_EINVAL;  /* 传输开始状态等待的消息必须是启动传输 */
            }

            /* 当前消息传输完成 */
            if (am_list_empty(&(p_cur_msg->transfers))) {

                p_cur_msg->actual_length = 0;

                /* 消息正在处理中 */
                if (p_cur_msg->status == -AM_EINPROGRESS) {
                    p_cur_msg->status = AM_OK;
                }

                /* notify the caller */
                if (p_cur_msg->pfn_complete != NULL) {
                    p_cur_msg->pfn_complete(p_cur_msg->p_arg);
                }

                /* 片选关闭 */
                __spi_cs_off(p_dev, p_dev->p_cur_spi_dev);

                __SPI_NEXT_STATE(__SPI_ST_MSG_START, __SPI_EVT_TRANS_LAUNCH);

            } else {

                /* 获取到一个传输，正确处理该传输即可 */
                am_spi_transfer_t *p_cur_trans = __spi_trans_out(p_cur_msg);
                p_dev->p_cur_trans             = p_cur_trans;

                /* reset current data pointer */
                p_dev->data_ptr       = 0;
                p_dev->nbytes_to_recv = 0;

                /* 配置SPI传输参数 */
                __spi_config(p_dev);

                /* 若为三线模式且接收缓存rx_buf不为空的时候 */
                if ((p_dev->p_cur_spi_dev->mode & AM_SPI_3WIRE) &&
                    (p_dev->p_cur_trans->p_rxbuf)) {

                    /* 把MOSI置为输入浮空 */
                    am_gpio_pin_cfg(p_dev->p_devinfo->mosi_pin, AM_GPIO_INPUT | AM_GPIO_FLOAT);
                }

                /* CS选通 */
                __spi_cs_on(p_dev, p_dev->p_cur_spi_dev);

                /* 下一状态是使用中断方式发送数据 */
                __SPI_NEXT_STATE(__SPI_ST_M_SEND_DATA, __SPI_EVT_M_SEND_DATA);
            }
            break;
        }

        case __SPI_ST_M_SEND_DATA:    /* 发送数据 */
        {
            am_spi_transfer_t *p_cur_trans = p_dev->p_cur_trans;

            if (event != __SPI_EVT_M_SEND_DATA) {
                return -AM_EINVAL;  /* 主机发送状态等待的消息必须是发送数据 */
            }

            /* 没有更多需要传送的数据了 */
            if (p_dev->data_ptr >= p_cur_trans->nbytes) {

                 /* 关闭中断等待发送就绪 */
                 amhw_hc32f460_spi_all_int_enable(p_hw_spi, AM_FALSE);

                 /* 回到传输开始状态 */
                 __SPI_NEXT_STATE(__SPI_ST_TRANS_START, __SPI_EVT_TRANS_LAUNCH);

                 break;
            } else {
                if (amhw_hc32f460_spi_flag_check (
                    p_hw_spi,
                    AMHW_HC32F460_SPI_STATUS_TXBUFFER_EMPTY) ==
                    AM_TRUE) {

                    /* 向从机写数据 */
                    __spi_write_data(p_dev);

                    __SPI_NEXT_STATE(__SPI_ST_M_RECV_DATA, __SPI_EVT_NONE);

                    /* 打开接收中断 */
                    amhw_hc32f460_spi_rx_int_enable(p_hw_spi, AM_TRUE);
                } else {

                    /* 打开中断等待发送就绪 */
                    amhw_hc32f460_spi_tx_int_enable(p_hw_spi, AM_TRUE);
                }
            }
            break;
        }

        case __SPI_ST_M_RECV_DATA:   /* 接收数据 */
        {
            if (event != __SPI_EVT_M_RECV_DATA) {
                return -AM_EINVAL;      /* 主机接收状态等待的消息必须是接收数据 */
            }

            /* 读取数据 */
            __spi_read_data(p_dev);

            /* 没有更多的数据需要接收了 */
            if (p_dev->nbytes_to_recv == 0) {

                /* 若为三线模式且接收缓存rx_buf不为空的时候 */
                if ((p_dev->p_cur_spi_dev->mode & AM_SPI_3WIRE) &&
                    (p_dev->p_cur_trans->p_rxbuf)) {

                    /* 重新置回MOSI模式 */
                    am_gpio_pin_cfg(p_dev->p_devinfo->mosi_pin, p_dev->p_devinfo->flags);
                }

                /* 传输剩余数据 */
                __SPI_NEXT_STATE(__SPI_ST_M_SEND_DATA, __SPI_EVT_M_SEND_DATA);

                /* 禁能发送及接收中断 */
                amhw_hc32f460_spi_tx_int_enable(p_hw_spi, AM_FALSE);
                amhw_hc32f460_spi_rx_int_enable(p_hw_spi, AM_FALSE);

            /* 需要接收更多数据 */
            } else {

                /* 这儿什么也不要做 */
            }
            break;
        }

        /*
         * 永远也不该运行到这儿
         */
        default:
            break;
        }

        /* 没有来自内部的信息, 跳出 */
        if (new_event == __SPI_EVT_NONE) {
            break;
        }
    }
    return AM_OK;
}

/******************************************************************************/

/**
 * \brief SPI初始化
 */
am_spi_handle_t am_hc32f460_spi_int_init (am_hc32f460_spi_int_dev_t           *p_dev,
                                          const am_hc32f460_spi_int_devinfo_t *p_devinfo)
{
    if (NULL == p_devinfo || NULL == p_dev ) {
        return NULL;
    }

    if (p_devinfo->pfn_plfm_init) {
        p_devinfo->pfn_plfm_init();
    }

    p_dev->spi_serve.p_funcs = (struct am_spi_drv_funcs *)&__g_spi_drv_funcs;
    p_dev->spi_serve.p_drv   = p_dev;

    p_dev->p_devinfo = p_devinfo;

    p_dev->p_cur_spi_dev    = NULL;
    p_dev->p_tgl_dev        = NULL;
    p_dev->lsbfirst         = AM_FALSE;
    p_dev->busy             = AM_FALSE;
    p_dev->p_cur_msg        = NULL;
    p_dev->p_cur_trans      = NULL;
    p_dev->data_ptr         = 0;
    p_dev->nbytes_to_recv   = 0;
    p_dev->state            = __SPI_ST_IDLE;/* 初始化为空闲状态 */

    am_list_head_init(&(p_dev->msg_list));

    if (__spi_hard_init(p_dev) != AM_OK) {
        return NULL;
    }

    am_int_connect(p_dev->p_devinfo->inum,
                   IRQ137_Handler,
                   (void *)p_dev);

    amhw_hc32f460_intc_int_vssel_bits_set(p_dev->p_devinfo->inum,
                                         (0x1f << (11 + (p_dev->p_devinfo->dev_id - 1) * 5)));

#if 0
        uint8_t spi_id = p_dev->p_devinfo->dev_id;

        uint32_t enIRQ_rx  = 20;
        uint32_t enIRQ_tx  = 21;
        uint32_t enIRQ_idle  = 22;
        uint32_t enIRQ_error = 23;

