zlgopen/ametal/soc/hdsc/drivers/source/spi/am_hc32f460_spi_int.c
        uint32_t INT_SPI_RX    = 299u + 5 * (spi_id - 1);
        uint32_t INT_SPI_TX    = 300u + 5 * (spi_id - 1);
        uint32_t INT_SPI_IDLE    = 301u + 5 * (spi_id - 1);
        uint32_t INT_SPI_ERROR   = 302u + 5 * (spi_id - 1);


    	stc_intc_sel_field_t *stcIntSel;

        stcIntSel = (stc_intc_sel_field_t *)((uint32_t)(0x40051000UL + 0x5c) + (4u * enIRQ_rx));
        stcIntSel->INTSEL = INT_SPI_RX;
        am_int_connect(enIRQ_rx, __spi_irq_handler, p_dev);
        am_int_enable(enIRQ_rx);

        stcIntSel = (stc_intc_sel_field_t *)((uint32_t)(0x40051000UL + 0x5c) + (4u * enIRQ_tx));
        stcIntSel->INTSEL = INT_SPI_TX;
        am_int_connect(enIRQ_tx, __spi_irq_handler, p_dev);
        am_int_enable(enIRQ_tx);

        stcIntSel = (stc_intc_sel_field_t *)((uint32_t)(0x40051000UL + 0x5c) + (4u * enIRQ_idle));
        stcIntSel->INTSEL = INT_SPI_IDLE;
        am_int_connect(enIRQ_idle, NULL, NULL);
        am_int_enable(enIRQ_idle);

        stcIntSel = (stc_intc_sel_field_t *)((uint32_t)(0x40051000UL + 0x5c) + (4u * enIRQ_error));
        stcIntSel->INTSEL = INT_SPI_ERROR;
        am_int_connect(enIRQ_error, NULL, NULL);
        am_int_enable(enIRQ_error);
#endif




    am_int_enable(p_dev->p_devinfo->inum);

    return &(p_dev->spi_serve);
}

/**
 * \brief SPI 去除初始化
 */
void am_hc32f460_spi_int_deinit (am_spi_handle_t handle)
{
    am_hc32f460_spi_int_dev_t *p_dev    = (am_hc32f460_spi_int_dev_t *)handle;
    amhw_hc32f460_spi_t       *p_hw_spi = (amhw_hc32f460_spi_t *)(p_dev->p_devinfo->spi_reg_base);

    if (NULL == p_dev) {
        return ;
    }

    p_dev->spi_serve.p_funcs = NULL;
    p_dev->spi_serve.p_drv   = NULL;

    /* 禁能SPI */
    amhw_hc32f460_spi_enable(p_hw_spi, AM_FALSE);

    /* 关闭SPI中断号并断开连接 */
    amhw_hc32f460_intc_int_vssel_bits_clr(p_dev->p_devinfo->inum,
                                         (0x1f << (11 + (p_dev->p_devinfo->dev_id - 1) * 5)));

    if (amhw_hc32f460_intc_int_vssel_get(p_dev->p_devinfo->inum) == 0){
        am_int_disable(p_dev->p_devinfo->inum);
    }

    am_int_disconnect(p_dev->p_devinfo->inum,
                      IRQ137_Handler,
                      (void *)p_dev);

    if (p_dev->p_devinfo->pfn_plfm_deinit) {
        p_dev->p_devinfo->pfn_plfm_deinit();
    }
}

/**
 * \brief SPI传输速度配置
 *
 */
am_local
uint32_t __spi_speed_cfg (am_hc32f460_spi_int_dev_t *p_dev,
                          uint32_t                target_speed)
{

    uint32_t clk, best_speed;  /* 计算出的速度 */
    uint8_t  i = 0;
    amhw_hc32f460_spi_clk_div_t baud_div = AMHW_HC32F460_SPI_CLK_DIV_2;

    amhw_hc32f460_spi_t *p_hw_spi = (amhw_hc32f460_spi_t *)(p_dev->p_devinfo->spi_reg_base);

    if(target_speed == 0) {
        baud_div = AMHW_HC32F460_SPI_CLK_DIV_2;
    } else {

        clk = am_clk_rate_get(p_dev->p_devinfo->clk_id);

        for(i = 1; i < 8; i++) {

            best_speed = clk >> i;
            if(best_speed <= target_speed) {
                break;
            }
        }
    }

    baud_div = (amhw_hc32f460_spi_clk_div_t)(i - 1);

    amhw_hc32f460_spi_clk_div_set(p_hw_spi, baud_div);

    best_speed = am_clk_rate_get(p_dev->p_devinfo->clk_id) /
                 (0x1ul << (baud_div + 1));

   return best_speed;
}

/* end of file */

